<div id="history" style="display: none;">
<h3>История версий</h3>

<p>Что нового в версии 1.8 (18.04.2016):</p>
<ul>
	<li>Добавлены регулировочные шайбы</li>
	<li>Проработана установка лестницы на черновой пол</li>
	<li>Испрвлены ошибки спецификации</li>

</ul>

<p>Что нового в версии 1.4 (04.10.2016):</p>
<ul>
	<li>Изменено оформление предложения</li>
	<li>Изменена методика расчета цены</li>
	<li>Изменено отображение себестоимости</li>

</ul>

<p>Что нового в версии 1.3 (04.10.2016):</p>
<ul>
	<li>Добавилась информация для производства</li>
	<li>Добавлен выбор цвета поручня ПВХ</li>
	<li>Добавлен цвет покраски металла</li>
	<li>Добавлен цвет покраски дерева</li>
	<li>Выводится высота подъема шага в характеристиках геометрии</li>
	<li>Изменена методика расчета высоты бобышки</li>
	<li>Изменена методика расчета кол-ва регулировочных шайб</li>
	<li>Под спецификацией добавлены ссылки на чертежи деталей</li>
	<li>Под формой параметров лестницы добавлено поле для комментариев</li>
	<li>Под спецификацией добавлено поле для комментариев</li>
	<li>Исправлена работа коэффициентов на цену и себестоимость</li>
	<li>Добавлены уголки крепления к верхнему перекрытию для лестниц с деревянными ступенями</li>
</ul>

<p>Что нового в версии 1.2 (03.10.2016):</p>
<ul>
	<li>Добавлен расчет себестоимости</li>
	<li>Изменен радиус скругления ступени и площадки где столб на 75мм независимо от диаметра столба</li>
	<li>Поправлен блок О компании</li>
	<li>Добавлена возможность отключения видовых экранов по одному</li>
	<li>Добавлен вырез на деревянной площадке</li>
</ul>

<p>Что нового в версии 1.1 (23.09.2016):</p>
<ul>
	<li>Добавлен поворот вправо и влево</li>
	<li>Добавлена возможность изменения выступа площадки</li>
</ul>

<p>Что нового в версии 1.0 (18.08.2016):</p>
<ul>
	<li>Программа работает;</li>
</ul>

</div>