<div id="description">
<h2>Особенности методики расчета</h2>
<ul class="galka">
	<li>Алгоритм расчета основан на принципах проектирования удобных лестниц, которые были
	выведены на основе опыта эксплуатации лестниц начиная с античности и до наших дней;</li>
	<li>Расчет параметров лестницы основан на итерационном методе решения системы линейных уравнений
	(решение СЛАУ методом Гаусса)</li>
	<li>Высота и ширина ступени подбираются в соответствии с формулой Блонделя. Лестница
	получается максимально удобной для данного угла наклона.</li>
	<li>Лестница проектируется максимально пологой, насколько это позволяет размер
проема в перекрытии</li>
	<li>Если размер проема не является огранчением, лестница проектируется с углом наклона не более
	30 градусов, чтобы она занимала не силишком много места.</li>
	<li>При проектировании учитывается высота габарита - расстояние над лестницей должно быть таким, 
	чтобы при ходьбе не задевать головой за край проема в перекрытии</li>
	<li>При расчете учитываются конструктивные особенности каркаса лестницы, крепления ступеней
	и ограждений, а также крепления лестницы к стенам и перекрытиям;</li>
	<li>Расчет всех параметров производится с точностью 0,05мм;</li>
</ul>

</div>