<div id="history" style="display: none;">
<h3>История версий:</h3>
<p>Что нового в версии 3.1 (16.03.2016):</p>
<ul>
	<li>Исправлена ошибка при построении лестницы с заданными параметрами</li>
	<li>Выдается предупреждение при несоответствии параметров среднего марша формуле шага</li>
	<li>Перед исходными данными можно указать номер заказа</li>
	<li>Заголовки, на которые надо нажать для расчета при наведении подсвечиваются голубым цветом</li>
</ul>
<p>Что нового в версии 3.0 (13.03.2016):</p>
<ul>
	<li>Убрал кнопку "рассчитать". Чтобы рассчитать надо нажать на надпись Результаты расчета</li>
	<li>Поменялись оформление формы ввода данных</li>
	<li>Поменялась методика расчета лестницы в узком проеме</li>
	<li>Добавлен расчет лестницы с заданными параметрами маршей</li>
</ul>

<p>Что нового в версии 1.0 (11.02.2016):</p>
<ul>
	<li>Калькулятор работает</li>
</ul>
</div>