<div id="aboutWrap">
	<h2>Немного о нас</h2>
	<p>
		Мы уже более 11 лет специализируемся на изготовлении внутренних интерьерных лестниц и
		ограждений из дерева, металла и стекла. У нас свое производство, оснащенное
		современными станками с ЧПУ, свой конструкторский отдел, штат
		высококвалифицированных столяров, сварщиков и монтажников с огромным опытом работы по
		лестницам. Мы занимаемся исключительно лестницами и ограждениями, благодаря этому нам
		удалось сформировать команду профессионалов, которые действительно разбираются в
		лестницах. Примеры наших работ Вы можете посмотреть на нашем сайте:
		<a href='https://lestnicy-perila.ru/about/objects.php'>lestnicy-perila.ru/about/objects.php</a>
	</p>
	<img src="/images/calculator/about/001.jpg">
	<img src="/images/calculator/about/002.jpg">
	<img src="/images/calculator/about/003.jpg">
	<img src="/images/calculator/about/004.jpg">

</div>