class Materials {
	static list = {
		// Дерево
		"сосна экстра": {
			"title":"Щит из сосны паркетной склейки",
			"description":"Древесина сосны - недорогое решение для изготовления лестницы, но ступени все же рекомендуется изготавливать из более твердых пород, поскольку срок службы таких ступеней несколько проигрывает остальным породам дерева. Внешний вид имеет слегка пеструю текстуру",
			"treadTitle": "Ступени из 100% массива сосны класса Экстра без сучков и других дефектов",
			"image": "/images/calculator/stairs/pine_prem.jpg"
		},
		"лиственница паркет.": {
			"title":"Щит из лиственницы паркетной склейки",
			"description":"Массив лиственницы по твердости уступает только дубу. Древесина имеет красивую контрастную текстуру с выраженными годичными кольцами, щит без сучков. Менее всего подвержен гниению. Паркетная склейка (в отличие от цельноламельной) склеена из коротких брусочков дерева, из-за чего и напоминает паркет",
			"treadTitle": "Ступени из 100% массива сибирской лиственницы класса Экстра без сучков и других дефектов",
			"image": "/images/calculator/stairs/larch.jpg"
		},
		"лиственница ц/л": {
			"title":"Щит из лиственницы цельноламельный",
			"description":"Массив лиственницы по твердости уступает только дубу. Древесина имеет красивую контрастную текстуру с выраженными годичными кольцами, щит без сучков. Менее всего подвержен гниению. Цельноламельная склейка более однородная по цвету, не такая пестрая, как паркетная склейка, поскольку в склейку идут только длинные бруски дерева",
			"treadTitle": "Ступени из 100% массива сибирской лиственницы класса Экстра без сучков и других дефектов",
			"image": "/images/calculator/stairs/larch_prem.jpg"
		},	
		"береза паркет.": {
			"title":"Щит из березы паркетной склейки",
			"description":"Массив березы характеризуется средним показателем твердости. Древесина имеет светлый оттенок с примесями бежево-розовых оттенков, присутствует шелковистый блеск",
			"treadTitle": "Ступени из 100% массива березы",
			"image": "/images/calculator/stairs/002.jpg"
		},
		"дуб паркет.": {
			"title":"Щит из дуба паркетной склейки",
			"description":"Щит дуба паркетной склейки -  склеивается из брусочков отборной древесины Краснодарского дуба. Очень плотная древесина, устойчива к царапинам, вмятинам, даже если Вы решите пройтись на шпильках по дубу. Отличается повышенной твердостью, благородным видом и самым длительным сроком службы",
			"treadTitle": "Ступени из 100% массива дуба",
			"image": "/images/calculator/stairs/003.jpg"
		},
		"дуб ц/л": {
			"title":"Щит из дуба цельноламельный",
			"description":"Щиты дуба класса Экстра склеиваются из отборной древесины, имеющей однородную текстуру и цвет по всей длине, что внешне выгодно отличает дуб цельноламельный от щита паркетной склейки. Отличается повышенной твердостью, благородным видом и самым длительным сроком службы",
			"treadTitle": "Ступени из 100% массива дуба класса Экстра",
			"image": "/images/calculator/stairs/004.jpg"
		},
		"дуб натур": {
			"title":"Слэб дуба",
			"description":"Цельный кусок дуба, без продольной и поперечной склейки. Наиболее ярко передает красоту древесного рисунка дуба. Не рассыхается, не растрескивается и не коробится благодаря нанесению специального отверждающего слоя. Премиум вариант",
			"treadTitle": "Ступени из слэбов дуба",
			"image": "/images/calculator/stairs/oak_slab.jpg"
		},
		"карагач натур": {
			"title":"Слэб карагача",
			"description":"Карагач наиболее ценная порода дерева. Помимо высокой прочности, устойчивости к гниению, карагач имеет контрастно-выраженные древесные кольца, что абсолютный тренд в интерьерах последних лет",
			"treadTitle": "Ступени из слэбов карагача",
			"image": "/images/calculator/stairs/elm_slab.jpg"
		},
		"дпк": {
			"title":"Доска ДПК",
			"description":"ДПК созана специально для улицы - смесь полимеров и древесной стружки. Нескользкая поверхность, даже при намокании. Не портится от влаги, жары и холода",
			"treadTitle": "Ступени из террасной доски ДПК",
			"treadDescription": [
				"Ступени состоят из несущеей стальной рамки и покрытия террасной доски ДПК,",
				"Ступени имеют усиленную конструкцию и каждая ступень выдерживает нагрузку до 250кг,",
				"Cтупени из террасной доски великолепно выглядят, нескользкие и долговечные,"
			],
			"image": "/images/calculator/stairs/008.jpg"
		},
		"шпон": {
			"title":"Натуральный шпон дуба",
			"description":"Шпон - это широкие и длинные пласты дерева, которые наклеиваются на МДФ или березовую фанеру. В результате изделия выглядят как цельное дерево. Только два способа достичь однородной текстуры дерева - это шпонирование или использование слэбов. Но слэбы слишком дороги, а шпонирование позволяет малой кровью добиться того же эффекта ",
			"treadTitle": "Ступени из мдф облицованного шпоном",
			"image": "/images/calculator/stairs/004.jpg"
		},
		// Метал
		"рифленая сталь": {
			"title":"Рифленая сталь",
			"description":"Благодаря рельефу обладает противоскользящими свойствами, что позволяет использовать ее на улице. Часто используются на производствах, благодаря чему плавно перетекли в интьеры в стиле Индастриал и Лофт.",
			"treadTitle": "Ступени из рифленой стали",
			"treadDescription": [
				"Ступени полностью металлические с покрытием из нескользкого рифленого стального листа,",
				"Ступени имеют усиленную конструкцию и каждая ступень выдерживает нагрузку до 250кг,",
				"Металлические ступени идеально подходят для уличных лестниц"
			],
			"image": "/images/calculator/stairs/005.jpg"
		},
		"сталь": {
			"title":"Конструкционная сталь",
			"description":"",
			"treadTitle": "",
			"treadDescription": "Конструкционная сталь повышенной прочности толщиной 8 мм - обеспечит жесткость конструкции и надежную опору на долгие года",
			"image": "/images/calculator/stairs/005.jpg"
		},
		"нержавейка": {
			"title":"Нержавеющая сталь",
			"description":"",
			"treadTitle": "",
			"treadDescription": "",
			"image": "/images/calculator/stairs/005.jpg"
		},
		"пресснастил": {
			"title":"Решетка из пресснастила",
			"description":"Пресснастил хорош тем, что влага на нем не задерживается, не возникает скольжения",
			"treadTitle": "Ступени из решетчатого настила",
			"treadDescription":[
				"Ступени предвтавляют собой решетку из стальных полос, поставленных на ребро,",
				"Ступени имеют усиленную конструкцию и каждая ступень выдерживает нагрузку до 250кг,",
				"Зимой на решетчатых ступенях не задерживается снег,",
				"Ступени защищены от коррозии методом горячего цинкования,"
			],
			"image": "/images/calculator/stairs/009.jpg"
		},
		"стекло": {
			"title":"Закаленное стекло",
			"description":"",
			"treadTitle": "Ступени из многослойного стекла",
			"treadDescription": [
				"Ступени состоят из несущеей стальной рамки и покрытия из двухслойного закаленного стекла толщиной 20мм,",
				"Ступени имеют усиленную конструкцию и каждая ступень выдерживает нагрузку до 250кг,",
				"Стеклянные ступени идеальный вариант при оформлении интерьера в стие Хайтек,"
			],
			"image": "/images/calculator/stairs/010.jpg"
		},
		"триплекс": {
			"title":"Закаленный триплекс",
			"description":"",
			"treadTitle": "Ступени из многослойного стекла",
			"treadDescription": [
				"Ступени состоят из несущеей стальной рамки и покрытия из двухслойного закаленного стекла толщиной 20мм,",
				"Ступени имеют усиленную конструкцию и каждая ступень выдерживает нагрузку до 250кг,",
				"Стеклянные ступени идеальный вариант при оформлении интерьера в стие Хайтек,"
			],
			"image": "/images/calculator/stairs/010.jpg"
		},
		"оптивайт": {
			"title":"Просветленное стекло Оптивайт",
			"description":"",
			"treadTitle": "Ступени из многослойного стекла",
			"treadDescription": [
				"Ступени состоят из несущеей стальной рамки и покрытия из двухслойного закаленного стекла толщиной 20мм,",
				"Ступени имеют усиленную конструкцию и каждая ступень выдерживает нагрузку до 250кг,",
				"Стеклянные ступени идеальный вариант при оформлении интерьера в стие Хайтек,"
			],
			"image": "/images/calculator/stairs/010.jpg"
		},
		"стекло тонированное": {
			"title":"Стекло тонированное в массе",
			"description":"",
			"treadTitle": "Ступени из многослойного стекла",
			"treadDescription": [
				"Ступени состоят из несущеей стальной рамки и покрытия из двухслойного закаленного стекла толщиной 20мм,",
				"Ступени имеют усиленную конструкцию и каждая ступень выдерживает нагрузку до 250кг,",
				"Стеклянные ступени идеальный вариант при оформлении интерьера в стие Хайтек,"
			],
			"image": "/images/calculator/stairs/010.jpg"
		},
		"стекло матовое": {
			"title":"Стекло матовое",
			"description":"",
			"treadTitle": "Ступени из многослойного стекла",
			"treadDescription": [
				"Ступени состоят из несущеей стальной рамки и покрытия из двухслойного закаленного стекла толщиной 20мм,",
				"Ступени имеют усиленную конструкцию и каждая ступень выдерживает нагрузку до 250кг,",
				"Стеклянные ступени идеальный вариант при оформлении интерьера в стие Хайтек,"
			],
			"image": "/images/calculator/stairs/010.jpg"
		},
		"монолитный поликарбонат": {
			"title":"Монолитный поликарбонат",
			"description":"",
			"treadTitle": "",
			"treadDescription": "",
			"image": "/images/calculator/stairs/010.jpg"
		},
		"сотовый поликарбонат": {
			"title":"Сотовый поликарбонат",
			"description":"",
			"treadTitle": "",
			"treadDescription": "",
			"image": "/images/calculator/stairs/010.jpg"
		},
		"металлочерепица": {
			"title":"Металлочерепица",
			"description":"",
			"treadTitle": "",
			"treadDescription": "",
			"image": "/images/calculator/stairs/010.jpg"
		},
		"профнастил": {
			"title":"Профнастил",
			"description":"",
			"treadTitle": "",
			"treadDescription": "",
			"image": "/images/calculator/stairs/010.jpg"
		},
		"эпоксидная смола": {
			"title":"Экологичная эпоксидная смола",
			"description":"",
			"treadTitle": "",
			"treadDescription": "",
			"image": "/images/calculator/stairs/010.jpg"
		}
	}


	/**
	 * Формирует описание на основе материалов сцены
	 */
	static getSceneDescription(){
		var sceneMaterials = []// Массив ключей материалов присутствующих в сцене
		view.scene.traverse(function(node){
			var material = node.material;
			if (material && material.userData && material.userData.materialKey) {
				if (sceneMaterials.indexOf(material.userData.materialKey) == -1) sceneMaterials.push(material.userData.materialKey);
			}
		})
		return Materials.getItemsDescription(sceneMaterials)
	}

	/**
	 * Формирует описание исходя из переданных ключей справочника
	 * @param {array} keys_list - ключи материалов из справочника
	 */
	static getItemsDescription(keys_list){
		var html = "";
		var json = {};
		var templateJson = [];
		keys_list.forEach(function(key){
			var materialInfo = Materials.list[key];
			json[key] = materialInfo;
			templateJson.push(materialInfo)
		});
		html = $.templates("#infoBlockTemplate").render({
			title: "Используемые материалы",
			blocks: templateJson
		});
		return {json: json, html: html}
	}

	/**
	 * Вывод всех материалов на страницу, для отладки
	 */
	static printAll(){
		$('#description').html("<div class='container'>" + Materials.getItemsDescription(Object.keys(Materials.list)).html + "</div>");
	}
}