<div id="history" style="display: none;">
<h3>История версий</h3>

<p>Что нового в версии 3.5 (18.12.2016):</p>
<ul>
	<li>Проработана прямая двухмаршевая лестница с промежуточной площадкой</li>
</ul>

<p>Что нового в версии 3.4 (20.11.2016):</p>
<ul>
	<li>В явном виде задается тип болтов каркаса и их покраска</li>
</ul>

<p>Что нового в версии 3.3 (10.11.2016):</p>
<ul>
	<li>Исправлена ошибка отрисовки тетив верхнего марша с забегом лестницы КО с нулевым кол-вом ступеней в верхнем марше</li>
	<li>Изменен принцип конфигурирования ограждения верхней площадки</li>
</ul>

<p>Что нового в версии 3.2 (02.10.2016):</p>
<ul>
	<li>Исправлены ошибки работы с базой</li>
	<li>Исправлена ошибка показа спецификации</li>
</ul>

<p>Что нового в версии 3.1 (30.09.2016):</p>
<ul>
	<li>Исправлена ошибка что не считаются рамки</li>
	<li>Исправлена ошибка что Не считается цена прямой лестницы лт</li>
	<li>Исправлена ошибка что Неправильно выводится себестоимость в таблицу</li>
	<li>Исправлена ошибка формы параметров ограждения лестницы</li>
	<li>Убираетсф строку с выбором цвета если без покраски</li>
	<li>Добавлен параметр куда ставим на нижнее перекрытие: чистовой/черновой пол, расстояние</li>
	<li>Расположение отверстий во фланце ar-15 относительно чистового пола верхнего этажа</li>
	<li>В правом меню добавлена возможность скрывать правое меню</li>
	<li>Убрана строка с шаблоном комплектации</li>
	<li>Убрана сборку из всех разделов, кроме сборки</li>
</ul>

<p>Что нового в версии 3.0 (22.09.2016):</p>
<ul>
	<li>Добавлена возможновть сохранения заказа на сервере</li>
	<li>Добавлен конструктор проемов/выступов в стенах</li>
	<li>Расширены возможности позиционирования стен</li>
	<li>Добавлен конструктор проема в перекрытии</li>
	<li>Добавлен конструктор балюстрады</li>
	<li>Конструкция ограждения балюстрады может отличаться от конструкции ограждений
	на лестнице</li>
	<li>Добавлена возможность управлять видимостью стен независимо для каждого видового экрана</li>
	<li>Добавлена возможность работы со слоями: в кадом видовом экране можно
	включать/отключать ступени, каркас, ограждения и т.п.</li>
	<li>Изменен внешний вид вывода себестоимости</li>
	<li>Добавлена возможность ввести пользовательский коэффициент на себестоимость</li>
	
</ul>
<p>Что нового в версии 2.20 (23.08.2016):</p>
<ul>
	<li>В спецификацию добавлен расчёт ограждений:</li>
</ul>

<p>Что нового в версии 2.19 (18.08.2016):</p>
<ul>
	<li>КП полностью пересчитывается при импорте геометрии или кп;</li>
	<li>Добавлен новый менеджер Сергей Блескин</li>
</ul>

<p>Что нового в версии 2.18 (11.08.2016):</p>
<ul>
	<li>На страницу добавлены блоки 3D-визуализации и спецификации;</li>
	<li>Расчёт стоимости лестницы (и каркаса, и ограждений) и построение её 3D-модели осуществляются по нажатию на кнопку-заголовок "Общая стоимость лестницы", расчёт спецификации осуществляется по нажатию на кнопку-заголовок "Спецификация";</li>
</ul>
<p>Что нового в версии 2.17 (02.08.2016):</p>
<ul>
	<li>Материалы стен и перекрытий по умолчанию не заданы;</li>
	<li>Добавлено поле комментариев к материалам стен и перекрытий;</li>	
</ul>
<p>Что нового в версии 2.16 (01.08.2016):</p>
<ul>
	<li>Исправлена ошибка расчета себестоимости сборки;</li>	
</ul>
<p>Что нового в версии 2.15 (30.06.2016):</p>
<ul>
	<li>По умолчанию для лт выставляется зазор от каркаса до стен 10мм, а для ко 75мм;</li>	
</ul>

<p>Что нового в версии 2.14 (29.06.2016):</p>
<ul>
	<li>Добавлены функции экспорта и импорта содержимого полей форм через xml;</li>	
</ul>

<p>Что нового в версии 2.13 (23.06.2016):</p>
<ul>
	<li>Изменена форма ввода исходных данных по каркасу;</li>	
	<li>Ширина верхней площадки принимается равной ширине марша</li>
</ul>

<p>Что нового в версии 2.12 (07.06.2016):</p>
<ul>
	<li>Исправлена ошибка - не считалась стоимость покрытия площадки на лестнице
	с площадкой наверху;</li>	
</ul>

<p>Что нового в версии 2.11 (24.05.2016):</p>
<ul>
	<li>При ширине марша более 1200мм стоимость каркаса увеличивается на 50% за из-за
добавления третьего косоура;</li>	
</ul>
<p>Что нового в версии 2.10 (08.10.2016):</p>
<ul>
	<li>Увеличилась стоимость цельноламельного дубового щита на 20%;</li>	
</ul>

<p>Что нового в версии 2.9 (30.03.2016):</p>
<ul>
	<li>Можно рассчитать только ограждения без лестницы. Для этого в поле Каркас надо выбрать "нет". При этом
	в поле ступени также выставится "нет". Рассчитать отдельно ступени на данный момент
	невозможно.;</li>	
</ul>

<p>Что нового в версии 2.8 (27.03.2016):</p>
<ul>
	<li>Уменьшена наценка на все ограждения;</li>	
</ul>

<p>Что нового в версии 2.7 (24.03.2016):</p>
<ul>
	<li>Уменьшена стоимость кованых ограждений;</li>	
	<li>Уменьшена стоимость ограждений с ригелями и со стеклом на стойках;</li>
</ul>

<p>Что нового в версии 2.6 (22.03.2016):</p>
<ul>
	<li>Исправлена ошибка при построении ограждений на лестнице с верхней площадкой: теперь
	количество стоек внешнего ограждения длинной площадки считается исходя из глубины площадки.
	Шаг между стойками не более 1 метра;</li>	
</ul>

<p>Что нового в версии 2.5 (21.03.2016):</p>
<ul>
	<li>В разделе себестоимость добавился коэффициент на монтаж;</li>	
	<li>Рассчитвается общая себестоимость и валовая прибыль;</li>
	<li>Исправлена ошибка расчета минимальной цены монтажа;</li>
</ul>

<p>Что нового в версии 2.4 (20.03.2016):</p>
<ul>
	<li>Можно скрыть/показать шапку;</li>	
	<li>Стоимость установки выводится только в расчете общей цены;</li>	
	<li>Внизу страницы добавлен раздел "Особенности проведения работ на объекте".
	Данные, введенные в этом разделе влияют на минимальную стоимость работ по установке лестницы;</li>
	<li>Стоимость сборки и установки лестницы считается с учетом минимальной стоимости;</li>
	<li>Если в особенностях работ на объекте выбрать подрезку ступеней или завязку поручней,
	количество выездов бригады автоматически увеличится на 1. При необходимости, потом можно поменять
	кол-во выездов вручную;</li>
	<li>Добавлено поле Ограничения по времени работы на объекте. Если ограничения жесткие,
	необходимо вручную увеличить количество выездов монтажников;</li>	
	
</ul>

<p>Что нового в версии 2.3 (16.03.2016):</p>
<ul>
	<li>Исправлена ошибка расчета стоимости лестницы с металлическими ступенями: в расчетах
	не учитывалась стоимость стального листа для покрытия ступеней;</li>	
	<li>Исправлена цена рифленого алюминиевого листа;</li>
	<li>Исправлена цена ступеней из пресснастила;</li>
	<li>Добавлены инструкции по расчету минимальной стоимости монтажа;</li>	
</ul>

<p>Что нового в версии 2.2 (16.03.2016):</p>
<ul>
	<li>Коэффициенты на цену перенесены из левого меню в блок себестоимости внизу страницы;</li>
	<li>Заголовки, на которые надо нажать для расчета при наведении подсвечиваются голубым цветом</li>
	<li>Добавлены поля для ввода цвета покраски дерева и металла. Поля растягиваются, чтобы туда
	можно было вписать все нюансы и требования Заказчика относительно покраски</li>
	<li>Если стоимость ограждения или ступеней нулевая, в разделе комплектации не показывается
	соответсвующий блок, а в разделе Общая цена не показывается нулевая стоимость;</li>
	<li>Добавлены поля в начале страницы для указания номера заказа, адреса объекта и фио менеджера;</li>

</ul>

<p>Что нового в версии 2.1 (15.03.2016):</p>
<ul>
	<li>Выводится адаптивный раздел комплектации лестницы;</li>
	<li>Содержание раздела комплектации лестницы меняется при расчете цены каркаса или цены ограждений;</li>
	<li>В левом меню добавлена возможность ввести коэффициенты на цену для того, чтобы подогнать
	расчет под необходимую сумму;</li>
	<li>Добавлен еще один способ посчитать общую цену: теперь если кликнуть мышкой по блоку
"Общая цена лестницы" пересчитается стоимость каркаса и ограждений;</li>
</ul>

<p>Что нового в версии 2.0 (14.03.2016):</p>
<ul>
	<li>Переработан внешний вид калькулятора;</li>
</ul>
</div>