<div id="description">
	<h2>Общий вид лестницы:</h2>
	<div class="toggleDiv">
		<div id="mainImages">
			<img src="/images/fire/001.jpg">
			<img src="/images/fire/002.jpg">
			<img src="/images/fire/003.jpg">
			<img src="/images/fire/004.jpg">
		</div>

		<div id="description">
			<p>Вертикальная пожарная лестница П-1.1/П-1.2, используется для подъема на кровлю здания сотрудников МЧС, в случае возникновения черезвычайной ситуации, а также для доступа персонала к инженерным коммуниациям, расположенным на кровле, выполняется по ГОСТ-53254-2009, собирается без сварки, спроектирована по всем современным требованиям, проходит испытания.
			</p>

			<h2>Особенности модели</h2>
			<ul class="galka">
				<li>Полностью соответствует ГОСТ-53254-2009;</li>
				<li>Срок службы более 50 лет;</li>
				<li>Гарантия 5 лет;</li>
				<li>Выдерживает большие нагрузки</li>
				<li id="paintDescript">надежное долговечное покрытие горячим цинкованием;</li>
				<li id="testingDescript">После монтажа проводим испытания по ГОСТ 53524-2009 и предоставляем все необходимые документы для МЧС;</li>
				<li>Лестница есть в наличи на складе;</li>
				<li id="assemblingDescript">Продуманная конструкция позволяет собрать и установить лестницу на объекте за 3-4 часа;</li>
			</ul>
		</div>
	</div>
</div>
