
<h3>Внутренние лестницы</h3>

<table class="tab_2"><tbody>
	<tr>
		<th>Комплектация</th>
		<th>Ступени</th>
		<th>Покраска металла</th>
		<th>Покраска дерева</th>		
		<th>Ограждения</th>
		<th>Сброка</th>
		<th></th>
	</tr>
	
	<tr>
		<td>Эконом</td>
		<td>Сосна кл.Б.</td>
		<td>нет</td> <!--покраска металла-->
		<td>нет</td> <!--покраска дерева-->		
		<td>Ригели черн.</td>
		<td>нет</td> <!--сборка-->
		<td><button id="in_ec_1">Применить</button></td> 
	</tr>
	<tr>
		<td>Эконом-2</td>
		<td>Сосна экстра</td>
		<td>порошок</td> <!--покраска металла-->
		<td>нет</td> <!--покраска дерева-->		
		<td>Ригели черн.</td>
		<td>нет</td> <!--сборка-->
		<td><button id="in_ec_2">Применить</button></td>
	</tr>
	
	<tr>
		<td>Стандарт-1</td>
		<td>лиственница паркет.</td>		
		<td>порошок</td> <!--покраска металла-->
		<td>лак</td> <!--покраска дерева-->		
		<td>стойки краш + ригели нерж.</td>
		<td>да</td> <!--сборка-->
		<td><button id="in_st_1">Применить</button></td>
	</tr>
	
	<tr>
		<td>Стандарт-2</td>
		<td>береза паркет.</td>
		<td>порошок</td> <!--покраска металла-->
		<td>лак</td> <!--покраска дерева-->		
		<td>стойки нерж + ригели нерж.</td>
		<td>да</td> <!--сборка-->
		<td><button id="in_st_2">Применить</button></td>
	</tr>
	
	<tr>
		<td>Стандарт-3</td>
		<td>береза паркет.</td>
		<td>порошок</td> <!--покраска металла-->
		<td>морилка+лак</td> <!--покраска дерева-->		
		<td>ковка</td>
		<td>да</td> <!--сборка-->
		<td><button id="in_st_3">Применить</button></td>
	</tr>
	
	<tr>
		<td>Премиум-1</td>
		<td>дуб паркет.</td>
		<td>порошок</td> <!--покраска металла-->
		<td>лак</td> <!--покраска дерева-->		
		<td>Стекло на стойках нерж.</td>
		<td>да</td> <!--сборка-->
		<td><button id="in_pr_1">Применить</button></td>
	</tr>
	
	<tr>
		<td>Премиум-2</td>
		<td>дуб ц/л</td>
		<td>порошок</td> <!--покраска металла-->
		<td>морилка+лак</td> <!--покраска дерева-->		
		<td>Стекло на стойках нерж.</td>
		<td>да</td> <!--сборка-->
		<td><button id="in_pr_2">Применить</button></td>
	</tr>
	
	<tr>
		<td>Премиум-3</td>
		<td>дуб ц/л</td>
		<td>порошок</td> <!--покраска металла-->
		<td>морилка+лак</td> <!--покраска дерева-->		
		<td>Стекло самонесущ.</td>
		<td>да</td> <!--сборка-->
		<td><button id="in_pr_3">Применить</button></td>
	</tr>

</tbody></table>


