<div id="history" style="display: none;">
<h3>История версий</h3>

<p>Что нового в версии 2.4 (30.03.2016):</p>
<ul>
	<li>Проработаны ограждения со стеклом</li>
</ul>

<p>Что нового в версии 2.3 (20.01.2016):</p>
<ul>
	<li>Изменен алгоритм расчета цены</li>
	<li>Совмещена балюстрада и лестница во втором и третьем экранах</li>
</ul>

<p>Что нового в версии 2.1 (27.09.2016):</p>
<ul>
	<li>Исправлена отрисовка левых лестниц</li>
	<li>Исправлена проблема с выбором поручня</li>
</ul>

<p>Что нового в версии 2.0 (25.09.2016):</p>
<ul>
	<li>Добавлена возможновть сохранения заказа на сервере</li>
	<li>Добавлен конструктор проемов/выступов в стенах</li>
	<li>Расширены возможности позиционирования стен</li>
	<li>Добавлен конструктор проема в перекрытии</li>
	<li>Добавлен конструктор балюстрады</li>
	<li>Конструкция ограждения балюстрады может отличаться от конструкции ограждений
	на лестнице</li>
	<li>Добавлена возможность управлять видимостью стен независимо для каждого видового экрана</li>
	<li>Добавлена возможность работы со слоями: в кадом видовом экране можно
	включать/отключать ступени, каркас, ограждения и т.п.</li>
	<li>Устранен ряд ошибок расчета стоимости</li>
	<li>Изменен внешний вид вывода себестоимости</li>
	<li>Добавлена возможность ввести пользовательский коэффициент на себестоимость</li>
</ul>
<p>Что нового в версии 1.0 (14.03.2016):</p>
<ul>
	<li>Программа работает</li>
</ul>

</div>