<div id="history" style="display: none;">
<h3>История версий</h3>

<p>Что нового в версии 1.4 (22.03.17):</p>
<ul>
	<li>Проработаны внешние ограждения маршей</li>
	<li>Проработаны колонны и консоли</li>
</ul>

<p>Что нового в версии 1.3 (01.03.17):</p>
<ul>
	<li>Изменены доступные высоты шага для модулей</li>
</ul>

<p>Что нового в версии 1.2 (16.02.17):</p>
<ul>
	<li>Исправлены коэффициенты на цену и себестоимость</li>
	<li>Добавлена возможность указать типы промежуточных креплений лестницы</li>
</ul>

</div>