<div id="manual" style="display: none;">
<h2>Руководство пользователя</h2>
<h3>Шаблоны комплектации лестниц.</h3>
<table class="tab_2"><tbody>
<tr><th>Комплектация</th><th>Ступени</th><th>Покраска металла</th><th>Покраска дерева</th><th>Сброка</th></tr>
<tr><td>Дерево 1</td><td>Дуб ц/л</td><td>Порошок</td><td>Морилка+Лак</td><td>да</td></tr>
<tr><td>Дерево 2</td><td>Дуб паркет.</td><td>Порошок</td><td>Лак</td><td>нет</td></tr>
<tr><td>Дерево 3</td><td>Береза паркет.</td><td>Порошок</td><td>нет</td><td>нет</td></tr>
<tr><td>Дерево 4</td><td>Сосна кл.Б.</td><td>нет</td><td>нет</td><td>нет</td></tr>
</tbody></table>
<h3>Расчет минимальной стоимости монтажных работ</h3>
<p>Стоимоть монтажных работ считается как 20% от стоимости лестницы, но не менее определенной суммы.
Минимальная стоимость монтажных работ рассчитывается следующим образом: </p>
<p>Стоимость выезда бригады монтажников - 13 000р за каждый выезд</p>
<p>Стоимость выезда инженера - 8 000р за каждый выезд</p>
<p>Стоимость выезда столяра для погонки на объекте - 7 000р за каждый выезд</p>
<p>Завязка поручней по месту - 2 000р/стык, но не менее 20 000р: добавляется выезд столяра и еще
один выезд бригады монтажников. Работы на монтаже проводятся 
в 2 этапа:<br/>
1. Поручни отправляются на монтаж в некрашенном виде. Отправляем одного столяра плюсом к монтажникам в день монтажа. Он зарезает все участки поручней, 
все подгоняет, делает разъемные и неразъемные стыки. Поручни снимаются и везутся в цех для покраски.<br/>
2. Выезжает бригада монтажников и монтирует покрашенные поручни.
</p>

<h4>Пример 1</h4>
<p>
Делаем лестницу с самонесущим стеклом + стекло на профиле на балюстраду, поручень делается в цеху
Стекла сразу заказываем по проекту, везем вместе с лестницей. <br/>
Монтаж производится в один этап.<br/>
<b>Минимальная стоимость монтажа - 13 000р (один выезд бригады монтажников)</b>
</p>
<h4>Пример 2</h4>
<p>
Делаем лестницу с самонесущим стеклом + стекло на рутелях на балюстраду, поручень изготавливается
и красится в цеху<br/>
Монтаж в 2 этапа: <br/>
1. Монтаж каркаса и шаблонов стекол балюстрады<br/>
2. Монтаж стекол и поручня<br/>
<b>Минимальная стоимость монтажа - 26 000р (два выезда бригады монтажников)</b>
</p>
<h4>Пример 3</h4>
<p>
Делаем лестницу с самонесущим стеклом + стекло на рутелях на балюстраду + подрезка ступеней 
без плинтуса + завязка поручня (2 стыка)<br/>
Монтаж в 2 этапа:<br/>
1. монтаж каркаса, шаблонов стекол балюстрады, подрезка некрашеных ступеней<br/>
2. монтаж ступеней, стекол и поручня<br/>
<b>Минимальная стоимость монтажа - 34 000р (2 выезда бригады + 1 выезд столяра)</b>
</p>
<h4>Пример 4</h4>
<p>
Делаем 10 метров самонесущего стекла на чужую лестницу  + завязка 
поручней на объекте (6 стыков).<br/>
Монтаж в 5 этапов:<br/>
1. Выезд инженера<br/>
2. Монтаж первых шаблонов<br/>
3. Монтаж вторых шаблонов<br/>
4. Монтаж стекла, зарезка и подгонка некрашенных поручней<br/>
5. Монтаж крашенных поручней<br/>
<b>Минимальная стоимость монтажа 67 000р (выезд инженера + 3 выезда монтажников 
+ 20 тыс. завязка поручней) </b>
</p>

<p>Варианты кованых балясин:<p>
<img id="bal_1" src="/images/calculator/kovka/001.gif">
<img id="bal_2" src="/images/calculator/kovka/002.gif">
<img id="bal_3" src="/images/calculator/kovka/003.gif">
<img id="bal_4" src="/images/calculator/kovka/004.gif">
<img id="bal_5" src="/images/calculator/kovka/005.gif">
<img id="bal_6" src="/images/calculator/kovka/006.gif">
<img id="bal_7" src="/images/calculator/kovka/007.gif">
<img id="bal_8" src="/images/calculator/kovka/008.gif">
<img id="bal_9" src="/images/calculator/kovka/009.gif">
<img id="bal_10" src="/images/calculator/kovka/010.gif">
<img id="bal_11" src="/images/calculator/kovka/011.gif">
<img id="bal_12" src="/images/calculator/kovka/012.gif">
<img id="bal_13" src="/images/calculator/kovka/013.gif">

<p>Варианты кованых столбов:<p>
<img id="stolb_1" src="/images/calculator/kovka/stolb/001.gif">
<img id="stolb_2" src="/images/calculator/kovka/stolb/002.gif">
<img id="stolb_3" src="/images/calculator/kovka/stolb/003.gif">


</div>